NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20a_flpr.svd
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Region configuration</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READ</name>
                <description>Read access</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Read access to override region [n] is not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Read access to override region [n] is allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Write access</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Write access to override region [n] is not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Write access to override region [n] is allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXECUTE</name>
                <description>Execute access</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Execute access to override region [n] is not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Execute access to override region [n] is allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECURE</name>
                <description>Secure access</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Both Secure and non-Secure access to override region [n] is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Only secure access to override region [n] is allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OWNER</name>
                <description>Owner ID</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotEnforced</name>
                    <description>Owner ID protection is not enforced</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITEONCE</name>
                <description>Write-once</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Write-once disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Write-once enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <description>Enable lock</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Lock disabled for region [n]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Lock enabled for region [n]</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SIZE</name>
                <description>Size in KBytes of region [n]</description>
                <lsb>16</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_GPIOHSPADCTRL_NS</name>
      <description>GPIO high-speed pad control 0</description>
      <baseAddress>0x40050400</baseAddress>
      <headerStructName>GPIOHSPADCTRL</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>GPIOHSPADCTRL</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>BIAS</name>
          <description>Bias control</description>
          <addressOffset>0x30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSBIAS</name>
              <description>Slew setting for high-speed pad (Use highest/fastest value)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>REPLICABIAS</name>
              <description>Slew setting for replica clock (used by the VPR coprocessor for emulating a QSPI peripheral)</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Input sampling and buffering control (used by the VPR coprocessor for emulating a QSPI peripheral)</description>
          <addressOffset>0x38</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RXDELAY</name>
              <description>Delay selection</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SCKEN</name>
              <description>Enable SCK</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Delay chain is reset and delayed sampling is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Delay chain and delayed sampling is active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCKPHASE</name>
              <description>SCK phase</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Inverted</name>
                  <description>Invert SCK phase</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NonInverted</name>
                  <description>Non-inverted SCK phase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSNEN</name>
              <description>Enable CSN synchronization of sampling</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Delay chain is reset on active edge of CSN</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Delay chain is not reset on active edge of CSN</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAENABLE</name>
              <description>Enable delayed sampling</description>
              <lsb>6</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Delayed sampling is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Delayed sampling is enabled</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
