NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lm20a_flpr.svd
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>SEQ[%s]</name>
          <description>Unspecified</description>
          <headerStructName>PWM_SEQ</headerStructName>
          <access>read-write</access>
          <addressOffset>0x520</addressOffset>
          <register>
            <name>REFRESH</name>
            <description>Description cluster: Number of additional PWM periods between samples loaded into compare register</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNT</name>
                <description>Number of additional PWM periods between samples loaded into compare register (load every REFRESH.CNT+1 PWM periods)</description>
                <lsb>0</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Continuous</name>
                    <description>Update every PWM period</description>
                    <value>0x000000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ENDDELAY</name>
            <description>Description cluster: Time added after the sequence</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNT</name>
                <description>Time added after the sequence in PWM periods</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>PWM_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x560</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>OUT[%s]</name>
            <description>Description collection: Output pin select for PWM channel n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>PWM_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x024</dimIncrement>
            <name>SEQ[%s]</name>
            <description>Unspecified</description>
            <headerStructName>PWM_DMA_SEQ</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>PTR</name>
              <description>Description cluster: RAM buffer start address</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PTR</name>
                  <description>RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>MAXCNT</name>
              <description>Description cluster: Maximum number of bytes in channel buffer</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MAXCNT</name>
                  <description>Maximum number of bytes in channel buffer</description>
                  <lsb>0</lsb>
                  <msb>14</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AMOUNT</name>
              <description>Description cluster: Number of bytes transferred in the last transaction, updated after the END event.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AMOUNT</name>
                  <description>Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte.</description>
                  <lsb>0</lsb>
                  <msb>14</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>CURRENTAMOUNT</name>
              <description>Description cluster: Number of bytes transferred in the current transaction</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AMOUNT</name>
                  <description>Number of bytes transferred in the current transaction. Continuously updated.</description>
                  <lsb>0</lsb>
                  <msb>14</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>TERMINATEONBUSERROR</name>
              <description>Description cluster: Terminate the transaction if a BUSERROR event is detected.</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERRORADDRESS</name>
              <description>Description cluster: Address of transaction that generated the last BUSERROR event.</description>
              <addressOffset>0x020</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
